#include <iostream>

using namespace std;
// ----------------------------------------
class C1
{
private:
    int* array;
    int  size;
public:
    C1(int s);
    ~C1();
};
C1::C1(int s)
{
    array = new int[s];
    size  = s;
    cout << "생성자 호출=> 요소수:" << size << endl;
}
C1::~C1()
{
    delete[] array;
    cout << "소멸자 호출=> 요소수:" << size << "의 요소가 파기됨" << endl;
}
// ----------------------------------------
int main()
{
    std::cout << "----------------------------------------\n";
    C1 o1(10);
    C1 o2(20);
    C1 o3(30);
    return 0;
}
// ----------------------------------------
// 생성자 호출=> 요소수:10
// 생성자 호출=> 요소수:20
// 생성자 호출=> 요소수:30
// 소멸자 호출=> 요소수:30의 요소가 파기됨
// 소멸자 호출=> 요소수:20의 요소가 파기됨
// 소멸자 호출=> 요소수:10의 요소가 파기됨
// ----------------------------------------
