#include <iostream>

using namespace std;
// ----------------------------------------
// ----------------------------------------
int main()
{
    cout << "----------------------------------------" << endl;
    char ch;
    cout << "문자열을 입력하시오:" << endl;
    while(cin.get(ch))
    {
        cout.put(ch);
    }
    cout << "----------------------------------------" << endl;
}
// ----------------------------------------
// 문자열을 입력하시오:
// TEST String
// TEST String
// ----------------------------------------
