#include <iostream>
#include <fstream>

using namespace std;
// ----------------------------------------
int main()
{
    cout << "----------------------------------------" << endl;
    ofstream fout;
    fout.open("p526.txt");
    if(!fout)
        cout << "파일 열기 실패" << endl;
    else
        cout << "파일 열기 성공" << endl;

    // ----------------------------------------
    fout << "Visual C++\n";
    fout << "가즈아\n";
    cout << "파일 쓰기 성공" << endl;
    // ----------------------------------------

    fout.close();
    cout << "파일 닫기" << endl;
    cout << "----------------------------------------" << endl;
}
// ----------------------------------------
// 파일 열기 성공
// 파일 쓰기 성공
// 파일 닫기
// ----------------------------------------